yanyuq/EPD-nRF51/main.c
    m_timestamp++;

    // Update calendar on 00:00:00
    if (m_calendar_mode && m_timestamp % 86400 == 0)
        calendar_update_schedule();
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
#if defined(S112)
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
#else
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
#endif
    // Create timers.
    err_code = app_timer_create(&m_clock_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                clock_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    // Start application timers.
    uint32_t err_code = app_timer_start(m_clock_timer_id, CLOCK_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

bool epd_cmd_callback(uint8_t cmd, uint8_t *data, uint16_t len)
{
    switch (cmd)
    {
        case EPD_CMD_SET_TIME:
            if (len < 4) {
                NRF_LOG_DEBUG("invalid time data!\n");
                return false;
            }

            NRF_LOG_DEBUG("time: %02x %02x %02x %02x\n", data[0], data[1], data[2], data[3]);
            if (len > 4) {
                NRF_LOG_DEBUG("timezone: %d\n", (int8_t)data[4]);
            }

            app_timer_stop(m_clock_timer_id);
            m_timestamp = (data[0] << 24) | (data[1] << 16) | (data[2] << 8) | data[3];
            m_timestamp += (len > 4 ? (int8_t)data[4] : 8) * 60 * 60; // timezone
            app_timer_start(m_clock_timer_id, CLOCK_TIMER_INTERVAL, NULL);
            calendar_update_schedule();
            return true;
        case EPD_CMD_CLEAR:
        case EPD_CMD_DISPLAY:
            m_calendar_mode = false;
            break;
        default:
            break;
    }
    return false;
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t       err_code;

    memset(&m_epd, 0, sizeof(ble_epd_t));
    err_code = ble_epd_init(&m_epd, epd_cmd_callback);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    char                    device_name[20];
    ble_gap_addr_t          addr;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
#if defined(S112)
    err_code = sd_ble_gap_addr_get(&addr);
#else
    err_code = sd_ble_gap_address_get(&addr);
#endif
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Bluetooth MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\n",
                   addr.addr[5], addr.addr[4], addr.addr[3],
                   addr.addr[2], addr.addr[1], addr.addr[0]);

    snprintf(device_name, 20, "%s_%02X%02X", DEVICE_NAME, addr.addr[1],addr.addr[0]);
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)device_name,
                                          strlen(device_name));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


static void advertising_start(void)
{
    NRF_LOG_INFO("advertising start\n");
#if defined(S112)
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
#else
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
#endif
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    NRF_LOG_DEBUG("Entering deep sleep mode\n");

    // Prepare wakeup pin
    ble_epd_sleep_prepare(&m_epd);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    uint32_t err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

void gpiote_evt_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
    NRF_LOG_DEBUG("pin: %d, event: %d\n", pin, action);

    nrf_drv_gpiote_in_event_disable(pin);
    nrf_drv_gpiote_in_uninit(pin);
    nrf_drv_gpiote_uninit();

    advertising_start();
}

static void setup_wakeup_pin(nrf_drv_gpiote_pin_t pin) {
    NRF_LOG_DEBUG("Setting up wakeup pin\n");

    ret_code_t err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_config_t config = GPIOTE_CONFIG_IN_SENSE_LOTOHI(false);

